# -*- mode: org; -*-
#+STARTUP: content
#+STARTUP: lognoteredeadline
#+STARTUP: lognotereschedule
#+TODO: TODO(t) WAIT(w@/!) ReTodo | DONE(d!) CANCELED(c@)
#+LINK: googlehttp://www.google.com/search?q=%s
?#+TAGS:
?#+TAGS: { MY_1(a) MY_2(b) } MY_3
?#+PRIORITIES: A z B
#+STARTUP: noptag
#+STARTUP: logdrawer
#+PROPERTY: Effort_ALL 0 0:10 0:30 1:00 2:00 3:00 4:00 5:00 6:00 7:00
?#+COLUMNS: %25ITEM %TAGS :skip-empty-rows 1 :maxlevel 5
#+COLUMNS: %40ITEM(Task) %17Effort(Estimated Effort){:} %CLOCKSUM

*** tmp test

| a | b | c | d      |
|---+---+---+--------|
| 1 | 2 | 3 | #ERROR |
| a | 4 | b |        |
| 5 | c | d |        |
|   |   |   |        |
#+TBLFM: @2$4='(delete-dups (list @2$1..@>$1));L

| a    | b | c | d                   |
|------+---+---+---------------------|
| 11f  | 2 | 3 | 11f                 |
| acwq | 4 | b | 11f acwq 5opc 2 4 c |
| 5opc | c | d | #ERROR              |
|      |   |   |                     |
#+TBLFM: @2$4='(concat (substring $1 1 2) (substring $1 0 1) (substring $1 2))::@3$4='(mapconcat 'identity (delete-dups (list @2$1..@>$1 @2$2..@>$2)) " ")::@4$4='(concat (delete-dups ( @2$1..@>$1 @2$2..@>$2)))
*** proj-1
    :PROPERTIES:
    :Owner:    Lisa
    :Status:   Not started yet
    :Time_Estimate: 3d 1h
    :Approved: [ ]
    :END:
    :LOGBOOK:
    CLOCK: [2017-12-20 Wed 17:52]--[2017-12-20 Wed 17:54] =>  0:02
    CLOCK: [2017-12-20 Wed 17:46]--[2017-12-20 Wed 17:48] =>  0:02
    CLOCK: [2017-12-20 Wed 17:19]--[2017-12-20 Wed 17:22] =>  0:03
    :END:

*** proj-2
    :PROPERTIES:
    :Owner:    Karl
    :STATUS:   Not started yet
    :Time_Estimate: 10d 10h
    :Approved: [X]
    :Effort:   4:00
    :END:
    :LOGBOOK:
    CLOCK: [2017-12-25 Mon 10:44]--[2017-12-25 Mon 10:45] =>  0:01
    CLOCK: [2017-12-20 Wed 17:54]--[2017-12-20 Wed 18:08] =>  0:14
    :END:
    
 dynamic blocks -- db
 #+BEGIN: columnview :hlines 1 :id local
 | ITEM       | Approved? | Owner | Status          | Time_Estimate | CLOCKSUM | CLOCKSUM_T |
 |------------+-----------+-------+-----------------+---------------+----------+------------|
 | quake zone | [-]       |       |                 | 13d 11:00     |     0:22 |       0:01 |
 | proj-1     | [ ]       | Lisa  | Not started yet | 3d 1h         |     0:07 |            |
 | proj-2     | [X]       | Karl  | Not started yet | 10d 10h       |     0:15 |       0:01 |
 #+END:

**** new year holidays
     :LOGBOOK:
     CLOCK: [2017-12-28 Thu 17:53]--[2017-12-28 Thu 17:56] =>  0:03
     CLOCK: [2017-12-28 Thu 17:24]--[2017-12-28 Thu 17:26] =>  0:02
     CLOCK: [2017-12-28 Thu 16:56]--[2017-12-28 Thu 17:15] =>  0:19
     :END:
     <2017-12-30 Sat>--<2018-01-01 Mon>

     #+BEGIN: clocktable :maxlevel 2 :scope subtree
     #+CAPTION: Clock summary at [2017-12-28 Thu 17:56]
     | Headline     | Time   |
     |--------------+--------|
     | *Total time* | *0:24* |
     |--------------+--------|
     #+END:
** -1 week
   :PROPERTIES:
   :Effort:   0:40
   :END:
   :LOGBOOK:
   CLOCK: [2018-01-02 Tue 21:09]--[2018-01-02 Tue 21:17] =>  0:08
   CLOCK: [2018-01-02 Tue 20:54]--[2018-01-02 Tue 21:09] =>  0:15
   CLOCK: [2018-01-02 Tue 20:14]--[2018-01-02 Tue 20:23] =>  0:09
   :END:
rock u start: [2018-01-02 Tue 12:18]
0..1 1..n.org
c-u c-c c-x ; org-timer-default-timer
when (/setq org-deadline-warning-days nil), no agenda ;P
when ~ 0, no warning, must have some number, then customize it; 
1. repeaters +/++/.+
2. schedule/warning days -5d/--1d
   %?/%a
   [[info:org#Capture%20templates][info:org#Capture templates]]
   [[info:org#Template%20expansion][info:org#Template expansion]]
3. effort estimates
4. relative timer :: reminder
   c-c c-x -/./0 :: insert timer note
   m-<RET> :: timer headline
5. column view

*** update packages through MELPA
    :LOGBOOK:
    CLOCK: [2017-12-20 Wed 18:08]--[2017-12-25 Mon 10:44] => 112:36
    :END:
    * [X] mark ring :: C-x C-<space>
    * [ ] list symbol alternate :: c-u nth C-c - 
    * undo, always, no un-undo :: M-x undo-only
**** formula with emacs Calc
 C-u C-u C-u <SPACE> <TAB>
 #+CONSTANTS: myPI=3.14159265358979323846
 |     <r3> | <c1>  |         | <l10> |           |
 |  Student | Maths | Physics | Mean  | Pi number |
 |----------+-------+---------+-------+-----------|
 |        / |   <   |         | >     |        <> |
 | Bertrand |  13   |      09 | 11    |         5 |
 |    Henri |  15   |      14 | 14.5  |         7 |
 |   Arnold |  17   |      13 | 15    |         9 |
 |----------+-------+---------+-------+-----------|
 |    Means |  15   |      12 | 13.5  |         7 |
 #+TBLFM: $4=vmean($2..$3)::$5='(substring (number-to-string $myPI) (round $4) (1+ (round $4)));N::@7$2=vmean(@4$2..@6$2)::@7$3=vmean(@4$3..@6$3)::@7$4=vmean(@4$4..@6$4)

**** TODO fromula with lisp                                           :LUFFY:

 | First name | Last Name | Email                |
 |------------+-----------+----------------------|
 | John       | Doe       | John.Doe@emacs.edu   |
 | Jennie     | Duh       | Jennie.Duh@emacs.edu |
 | Jack       | Goody     | Jack.Goody@emacs.edu |
 #+TBLFM: $3='(concat $1 "." $2 "@emacs.edu")

 | First name | Last name | Maths | French | Mean       |
 |------------+-----------+-------+--------+------------|
 | John       | Doe       |    12 |     16 | John: 14   |
 | Jennie     | Duh       |    15 |      9 | Jennie: 12 |
 #+TBLFM: $5='(concat "$1" ": " (number-to-string (/ (+ $3 $4) 2)));L

 | col1 | col2 | col3                       | col4         | col5 |
 |------+------+----------------------------+--------------+------|
 | a    | a    | a b c d                    | #ERROR       |      |
 | a    | b    | [a, a, b, c], [a, b, a, d] | [a, a, b, c] |      |
 | b    | a    | a a b c a b a d            | [a, b, a, d] |      |
 | c    | d    |                            | #ERROR       |      |
 |      |      |                            | c            | d    |
 #+TBLFM: @2$3='(mapconcat 'identity (delete-dups (list @2$1..@>$1 @2$2..@>$2)) " ")::@2$4='(mapconcat 'identity (union (list @2$1..@>$1) (list @2$2..@>$2))) " ")::@3$3=@2$1..@>$1 , @2$2..@>$2::@3$4=@2$1..@>$1::@4$3='(mapconcat 'identity (list @2$1..@>$1 @2$2..@>$2) " ")::@4$4=@2$2..@>$2::@5$4='(member '(a) @2$2..@>$2)::@6$4='(apply 'concat (delete-if (lambda(e) (member e (list @2$2..@>$2))) (list @2$1..@>$1)))::@6$5='(apply 'concat (delete-if (lambda(e) (member e (list @2$1..@>$1))) (list @2$2..@>$2)))

 - delete-dups, intersection, union :: [[https://www.gnu.org/software/emacs/manual/html_mono/elisp.html][elisp-mono-web]]
 - lambda DIY jianshu :: [[https://www.jianshu.com/p/ec64f8286875][lambda for lisp in org spreedtable formulas]]
 - M-x hel m :: major/minor Mode enabled [[https://www.gnu.org/software/emacs/manual/html_mono/emacs.html#Modes][emacs' mode]]
 - M-x package.... highlight-pare :: hl-pare
 - colors 4 parentheses :: M-x help color-name-rgb-alist 

*** WAIT split from above "time-stamps"
    SCHEDULED: <2018-01-04 Thu +0d>
    :PROPERTIES:
    :LAST_REPEAT: [2017-12-29 Fri 16:41]
    :END:
    org-log-redeadline ??? -> ok after split from schedules
    (setq org-log-redeadline 'note)
    :PROPERTIES:
    :ORDERED:  t
    :END:
    :LOGBOOK:
    - State "WAIT"       from "TODO"       [2017-12-29 Fri 16:42] \\
      m-2 c-c c-t cause sequense visit todoKeyList
    - State "DONE"       from "ReTodo"     [2017-12-29 Fri 16:41]
    - State "ReTodo"     from "WAIT"       [2017-12-29 Fri 16:41]
    - State "WAIT"       from "TODO"       [2017-12-29 Fri 16:41]
    - State "DONE"       from "TODO"       [2017-12-29 Fri 16:41]
    - State "DONE"       from "TODO"       [2017-12-29 Fri 15:30]
    - State "DONE"       from "TODO"       [2017-12-29 Fri 02:13]
    - State "DONE"       from "TODO"       [2017-12-29 Fri 01:36]
    - State "DONE"       from "TODO"       [2017-12-29 Fri 01:28]
    - State "DONE"       from "DONE"       [2017-12-29 Fri 01:28]
    - State "DONE"       from "DONE"       [2017-12-29 Fri 01:27]
    - State "DONE"       from "TODO"       [2017-12-29 Fri 00:46]
    - State "DONE"       from "TODO"       [2017-12-29 Fri 00:43]
    - State "DONE"       from "TODO"       [2017-12-29 Fri 00:41]
    - Not scheduled, was "[2017-12-25 Mon +2d]" on [2017-12-29 Fri 00:28] \\
      next try
    - State "DONE"       from "TODO"       [2017-12-29 Fri 00:14]
    - State "DONE"       from "TODO"       [2017-12-29 Fri 00:13]
    - State "DONE"       from "TODO"       [2017-12-29 Fri 00:13]
    - State "DONE"       from "TODO"       [2017-12-29 Fri 00:12]
    - State "DONE"       from "TODO"       [2017-12-29 Fri 00:07]
    - State "TODO"       from "WAIT"       [2017-12-29 Fri 00:01]
    - State "WAIT"       from "TODO"       [2017-12-29 Fri 00:01]
    - State "DONE"       from "WAIT"       [2017-12-29 Fri 00:00]
    - State "WAIT"       from "TODO"       [2017-12-29 Fri 00:00]
    - State "DONE"       from "TODO"       [2017-12-28 Thu 23:59]
    - State "DONE"       from "TODO"       [2017-12-28 Thu 23:54]
    - Not scheduled, was "[2017-12-27 Wed +1w]" on [2017-12-28 Thu 23:53] \\
      for repeater
    - State "DONE"       from "DONE"       [2017-12-28 Thu 23:52]
    - State "DONE"       from "TODO"       [2017-12-28 Thu 23:48]
    - State "DONE"       from "TODO"       [2017-12-28 Thu 23:47]
    - State "DONE"       from "TODO"       [2017-12-28 Thu 23:46]
    - State "DONE"       from "TODO"       [2017-12-28 Thu 23:41]
    - Removed deadline, was "[2017-12-31 Sun]" on [2017-12-28 Thu 23:38] \\
      split from schedules
    - State "DONE"       from "WAIT"       [2017-12-28 Thu 23:35]
    - State "WAIT"       from "TODO"       [2017-12-28 Thu 23:34] \\
      test
]
    - Rescheduled from "[2017-12-27 Wed +2d]" on [2017-12-28 Thu 23:33]
    - State "DONE"       from "TODO"       [2017-12-28 Thu 23:20]
    - Not scheduled, was "[2017-11-27 Wed +1w]" on [2017-12-28 Thu 23:11] \\
      test change after note reason
    - State "DONE"       from "TODO"       [2017-12-28 Thu 23:03]
    - State "CANCELED"   from "DONE"       [2017-12-28 Thu 22:58] \\
      try to set repeater
    - State "DONE"       from "TODO"       [2017-12-28 Thu 22:58]
    - State "DONE"       from "TODO"       [2017-12-28 Thu 22:54]
    - State "DONE"       from "TODO"       [2017-12-28 Thu 22:51]
    - State "DONE"       from "TODO"       [2017-12-28 Thu 22:50]
    CLOCK: [2017-12-28 Thu 21:06]--[2017-12-28 Thu 22:50] =>  1:44
    CLOCK: [2017-12-28 Thu 20:08]--[2017-12-28 Thu 20:46] =>  0:38
    CLOCK: [2017-12-28 Thu 20:00]--[2017-12-28 Thu 20:08] =>  0:08
    CLOCK: [2017-12-28 Thu 19:02]--[2017-12-28 Thu 19:52] =>  0:50
    CLOCK: [2017-12-28 Thu 18:59]--[2017-12-28 Thu 19:02] =>  0:03
    CLOCK: [2017-12-28 Thu 17:56]--[2017-12-28 Thu 18:12] =>  0:16
    CLOCK: [2017-12-28 Thu 17:26]--[2017-12-28 Thu 17:28] =>  0:02
    CLOCK: [2017-12-28 Thu 17:15]--[2017-12-28 Thu 17:23] =>  0:08
    CLOCK: [2017-12-28 Thu 16:00]--[2017-12-28 Thu 16:56] =>  0:56
    - State "DONE"       from "TODO"       [2017-12-28 Thu 15:00]
    - State "DONE"       from "WAIT"       [2017-12-28 Thu 14:57]
    CLOCK: [2017-12-28 Thu 14:56]--[2017-12-28 Thu 14:56] =>  0:00
    - State "WAIT"       from "DONE"       [2017-12-28 Thu 14:56] \\
      4 test...
    - State "DONE"       from "TODO"       [2017-12-28 Thu 14:55]
    - State "DONE"       from "DONE"       [2017-12-28 Thu 14:55]
    - State "DONE"       from              [2017-12-28 Thu 14:51]
    CLOCK: [2017-12-28 Thu 14:51]--[2017-12-28 Thu 14:51] =>  0:00
    :END:
1. c-c a :: weekly/daily
2. c-x c-b :: m -> v == 2; v -> c; c-k/d x; s/~/%(v) ...  :buffers:emacs manual:
	      [[https://www.gnu.org/software/emacs/manual/html_mono/emacs.html#Several-Buffers][Several-Buffers]]
3. disable c-x c-u/l :: CAUTION, EVEN NOT in emacs manual! Please use M-x ...
4. special sexp diary entries
   <%%(diary-float t 4 2)>
* The column view
  :LOGBOOK:
  CLOCK: [2018-01-02 Tue 21:11]--[2018-01-02 Tue 21:16] =>  0:05
  CLOCK: [2018-01-02 Tue 17:33]--[2018-01-02 Tue 17:33] =>  0:00
  CLOCK: [2018-01-02 Tue 18:02]--[2018-01-02 Tue 18:03] =>  0:01
  CLOCK: [2017-12-25 Mon 10:51]--[2018-01-02 Tue 18:02] => 199:11
  :END:




#+BEGIN: columnview :hlines 1 :id global
| ITEM                                                                                              | TAGS            |
|---------------------------------------------------------------------------------------------------+-----------------|
| * CANCELED Top level headline                                                                     |                 |
| ** 2nd level                                                                                      |                 |
| *** 3rd level                                                                                     |                 |
| *** 3rd level                                                                                     |                 |
|---------------------------------------------------------------------------------------------------+-----------------|
| * pandas                                                                                          |                 |
| ** theory                                                                                         |                 |
| ** Do it                                                                                          |                 |
| *** gear-tools                                                                                    |                 |
| *** container                                                                                     |                 |
| *** time...line.                                                                                  |                 |
|---------------------------------------------------------------------------------------------------+-----------------|
| * Repo_dict                                                                                       |                 |
| ** theory                                                                                         |                 |
| ** Do it                                                                                          |                 |
| *** container/box                                                                                 |                 |
| *** DONE mathod [0/3]                                                                             | :1BY1:          |
| **** TODO LONG(l/@)\vert unto smt                                                                 |                 |
|---------------------------------------------------------------------------------------------------+-----------------|
| * new page[0%]                                                                                    |                 |
| ** customID                                                                                       |                 |
| ** custID                                                                                         |                 |
| *** myfavor                                                                                       |                 |
| **** Goldberg Variations                                                                          |                 |
| **** 1st                                                                                          |                 |
| *** links(4th-level cannot export to PDF)[0%]                                                     |                 |
| ** TODO [#G] Shave[/]                                                                             | :org:habit:     |
| *** habitica                                                                                      |                 |
|---------------------------------------------------------------------------------------------------+-----------------|
| * new mon[0/0]                                                                                    |                 |
| ** this week                                                                                      | :luffy:caution: |
| *** tmp test                                                                                      |                 |
| ** columns in properites[0/0]                                                                     |                 |
| ** region marks rectangle>>>vim:c-v column                                                        |                 |
| ** quake zone                                                                                     | :LUFFY:         |
| *** proj-1                                                                                        |                 |
| *** proj-2                                                                                        |                 |
| **** new year holidays                                                                            |                 |
| ** last week                                                                                      |                 |
| *** tags[0/0]                                                                                     |                 |
| *** Blocks in context exa C linux kernel                                                          | :LUFFY:         |
| *** WANTED tags                                                                                   | :LUFFY:         |
| **** Don't forget to press C-c C-c with the cursor in one of these lines to activate any changes. | :Caution:       |
|---------------------------------------------------------------------------------------------------+-----------------|
| * new tue                                                                                         |                 |
| ** last week                                                                                      |                 |
| *** update packages through MELPA                                                                 |                 |
| ** this week                                                                                      |                 |
|---------------------------------------------------------------------------------------------------+-----------------|
| * new wed                                                                                         |                 |
| ** last week                                                                                      |                 |
| *** org spreadsheet system                                                                        |                 |
| **** formula with emacs Calc                                                                      |                 |
| **** TODO fromula with lisp                                                                       | :LUFFY:         |
| ** this week                                                                                      |                 |
|---------------------------------------------------------------------------------------------------+-----------------|
| * new thur                                                                                        |                 |
| ** last week                                                                                      |                 |
| ** this week                                                                                      |                 |
| *** DONE time-stamps                                                                              |                 |
| *** TODO split from above "time-stamps"                                                           |                 |
| *** TODO split from above-nyh                                                                     |                 |
| **** TODO repeater-rerun                                                                          | :TEST:          |
| *** ReTodo date/time prompt/formats                                                               | :Caution:       |
| *** calendar motion [calendar/agenda]                                                             |                 |
|---------------------------------------------------------------------------------------------------+-----------------|
| * <<<1                                                                                            |                 |
|---------------------------------------------------------------------------------------------------+-----------------|
| * Footnotes                                                                                       |                 |
|---------------------------------------------------------------------------------------------------+-----------------|
| * The column view                                                                                 |                 |
#+END:
